src/cf/Reports/уатКарточкаРаботыАвтомобильнойШины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>уатКарточкаРаботыАвтомобильнойШины</Name>
			<Comment>Карточка работы автомобильной шины</Comment>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/InformationRegisters/уатАгрегатыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатАгрегатыТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МестоУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМестаУстановкиШин</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеАгрегата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСостоянияАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТС</Name>
					<Comment>В составе ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньИзноса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьМОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/уатИзносАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатИзносАгрегатов</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Износ</Name>
					<Comment>Износ в валюте агрегата</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатМестонахождениеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатМестонахождениеТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/уатОстаткиАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатОстаткиАгрегатов</Name>
			<Comment>Остатки агрегатов на складах</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/уатСостоянияАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатСостоянияАгрегатов</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстановленоВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановленоВЗапас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановленоНеисправно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Снято</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Reports/уатКарточкаРаботыАвтомобильнойШины/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаКон = НачалоМесяца(ТекущаяДата())-1;
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
	КонецЕсли;
	
	Если Параметры.Свойство("Шина") Тогда
		Шина = Параметры.Шина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Шина) Тогда
		Сформировать(Неопределено);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Шина) Тогда
		Если НЕ ЗначениеЗаполнено(СерийныйНомер) Тогда
			ТекстНСТР = НСтр("en='Tire not specified!';ru='Не указана шина!'");
			ПоказатьПредупреждение(, ТекстНСТР, 10);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТабДок = СформироватьОтчет();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ШинаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Шина) Тогда
		СерийныйНомер = ПолучитьСерийныйНомер(Шина);
	Иначе
		СерийныйНомер = "";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСерийныйНомер(Шина)
	Возврат Шина.СерийныйНомер;
КонецФункции

&НаСервере
Функция СформироватьОтчет()
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ЗапросУстановкаСнятие = Новый Запрос();
	
	ЗапросУстановкаСнятие.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УстановленоНаТС.Период КАК ДатаУстановкиШиныНаТС,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаСнятияШиныСТС,
	|	УстановленоНаТС.СерияНоменклатуры КАК Шины,
	|	УстановленоНаТС.ТС КАК ТС,
	|	УстановленоНаТС.ТС.Модель КАК МодельТС,
	|	УстановленоНаТС.ТС.ГаражныйНомер КАК ИнвНомерТС,
	|	УстановленоНаТС.ТС.ГосударственныйНомер КАК ГосударственныйНомер,
	|	УстановленоНаТС.МестоУстановки КАК МестоУстановки,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(200)) КАК РегистраторПричинаОбращения,
	|	УстановленоНаТС.СерияНоменклатуры.Модель КАК СерияНоменклатурыМодель,
	|	УстановленоНаТС.СерияНоменклатуры.Наименование КАК СерияНоменклатурыНаименование
	|ИЗ
	|	РегистрСведений.уатАгрегатыТС КАК УстановленоНаТС
	|ГДЕ
	|	УстановленоНаТС.СостояниеАгрегата = ЗНАЧЕНИЕ(Перечисление.уатСостоянияАгрегатов.УстановленоВРаботе)";
	
	Если ЗначениеЗаполнено(Шина) Тогда
		ЗапросУстановкаСнятие.УстановитьПараметр("Шина", Шина);
		ЗапросУстановкаСнятие.Текст = ЗапросУстановкаСнятие.Текст + "
		| И УстановленоНаТС.СерияНоменклатуры = &Шина";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СерийныйНомер) Тогда
		ЗапросУстановкаСнятие.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
		ЗапросУстановкаСнятие.Текст = ЗапросУстановкаСнятие.Текст + "
		| И УстановленоНаТС.СерияНоменклатуры.СерийныйНомер = &СерийныйНомер";
	КонецЕсли;

	ЗапросУстановкаСнятие.Текст = ЗапросУстановкаСнятие.Текст + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СнятоСТС.Период КАК ДатаСнятияШиныСТС,
	|	СнятоСТС.СерияНоменклатуры КАК Шины,
	|	СнятоСТС.ТС КАК ТС,
	|	СнятоСТС.МестоУстановки КАК МестоУстановки,
	|	СнятоСТС.Регистратор.ПричинаОбращения КАК РегистраторПричинаОбращения
	|ИЗ
	|	РегистрСведений.уатАгрегатыТС КАК СнятоСТС
	|ГДЕ
	|	СнятоСТС.СостояниеАгрегата = ЗНАЧЕНИЕ(Перечисление.уатСостоянияАгрегатов.Снято)";
	
	Если ЗначениеЗаполнено(Шина) Тогда
		ЗапросУстановкаСнятие.Текст = ЗапросУстановкаСнятие.Текст + "
		| И СнятоСТС.СерияНоменклатуры = &Шина";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СерийныйНомер) Тогда
		ЗапросУстановкаСнятие.Текст = ЗапросУстановкаСнятие.Текст + "
		| И СнятоСТС.СерияНоменклатуры.СерийныйНомер = &СерийныйНомер";
	КонецЕсли;
	
	мсвРезультаты = ЗапросУстановкаСнятие.ВыполнитьПакет();
		
	ТабУстановки = мсвРезультаты[0].Выгрузить();
	ТабСнятия    = мсвРезультаты[1].Выгрузить();
	
	ФлагОбщаяМодель			 = Истина;
	ФлагОбщееНаименование	 = Истина;
	НомерСторки				 = 1;
	МодельШины				 = Шина.Модель;
	ОбозначениеШины			 = "";
	мШина					 = Новый Массив();
	Для Каждого ТекСтрока Из ТабУстановки Цикл
		
		ФлагОбщаяМодель			 = ТекСтрока.СерияНоменклатурыМодель = МодельШины ИЛИ НомерСторки = 1;
		ФлагОбщееНаименование	 = ТекСтрока.СерияНоменклатурыНаименование = ОбозначениеШины ИЛИ НомерСторки = 1;
		МодельШины				 = ТекСтрока.СерияНоменклатурыМодель;
		ОбозначениеШины			 = ТекСтрока.СерияНоменклатурыНаименование;
		мШина.Добавить(ТекСтрока.Шины);
		
		НайдСтроки = ТабСнятия.НайтиСтроки(Новый Структура("ТС,МестоУстановки",ТекСтрока.ТС,ТекСтрока.МестоУстановки));
		Если НайдСтроки.Количество() Тогда 
			Для Каждого СтрокаСнятия Из НайдСтроки Цикл 
				Если СтрокаСнятия.ДатаСнятияШиныСТС >= ТекСтрока.ДатаУстановкиШиныНаТС Тогда 
					ТекСтрока.ДатаСнятияШиныСТС = СтрокаСнятия.ДатаСнятияШиныСТС;
					ТекСтрока.РегистраторПричинаОбращения = СтрокаСнятия.РегистраторПричинаОбращения;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		НомерСторки = НомерСторки + 1;
	КонецЦикла;
	
	ЗапросПробег = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросПробег.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЗапросПробег.Текст = 
	"ВЫБРАТЬ
	|	уатИзносАгрегатовОбороты.ТС КАК ТС,
	|	уатИзносАгрегатовОбороты.СерияНоменклатуры КАК СерияНоменклатуры,
	|	уатИзносАгрегатовОбороты.Организация КАК Организация,
	|	СУММА(уатИзносАгрегатовОбороты.ПробегОборот) КАК ПробегОборот,
	|	НАЧАЛОПЕРИОДА(уатИзносАгрегатовОбороты.Период, МЕСЯЦ) КАК Месяц,
	|	Максимум(уатИзносАгрегатовОбороты.Период) КАК Период2
	|ИЗ
	|	РегистрНакопления.уатИзносАгрегатов.Обороты(, &ДатаКон, Запись, ";
	Если ЗначениеЗаполнено(Шина) Тогда
		ЗапросПробег.Параметры.Вставить("Шина", Шина);
		ЗапросПробег.Текст = ЗапросПробег.Текст + "СерияНоменклатуры = &Шина";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СерийныйНомер) Тогда
		ЗапросПробег.Параметры.Вставить("СерийныйНомер", СерийныйНомер);
		ЗапросПробег.Текст = ЗапросПробег.Текст +
		?(ЗначениеЗаполнено(Шина), " И ", "") + "СерияНоменклатуры.СерийныйНомер = &СерийныйНомер";
	КонецЕсли;
	
	ЗапросПробег.Текст = ЗапросПробег.Текст +") КАК уатИзносАгрегатовОбороты";
	
	ЗапросПробег.Текст = ЗапросПробег.Текст + "
	|СГРУППИРОВАТЬ ПО
	|	уатИзносАгрегатовОбороты.ТС,
	|	уатИзносАгрегатовОбороты.Организация,
	|	уатИзносАгрегатовОбороты.СерияНоменклатуры,
	|	НАЧАЛОПЕРИОДА(уатИзносАгрегатовОбороты.Период, МЕСЯЦ)
	|УПОРЯДОЧИТЬ ПО
	|	Месяц,
	|	Период2
	|ИТОГИ
	|	МАКСИМУМ(СерияНоменклатуры),
	|	МАКСИМУМ(Организация),
	|	СУММА(ПробегОборот)
	|ПО
	|	Месяц ПЕРИОДАМИ(МЕСЯЦ, , &ДатаКон)";
	
	ЗапросПробег.УстановитьПараметр("ДатаКон", ДатаКон);
	РезультатЗапроса = ЗапросПробег.Выполнить();
	ВыборкаВерхняя = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Месяц", "ВСЕ");
	
	ТаблицаПробега = Новый ТаблицаЗначений;
	ТаблицаПробега.Колонки.Добавить("ТС", Новый ОписаниеТипов("СправочникСсылка.уатТС"));
	ТаблицаПробега.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.уатСерииНоменклатуры"));
	ТаблицаПробега.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаПробега.Колонки.Добавить("ПробегОборот", Новый ОписаниеТипов("Число"));
	ТаблицаПробега.Колонки.Добавить("ПробегОбщий", Новый ОписаниеТипов("Число"));
	ТаблицаПробега.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	ПредыдущаяСтрока = Новый Структура;
	ПредыдущаяСтрока.Вставить("ТС");
	ПредыдущаяСтрока.Вставить("СерияНоменклатуры");
	ПредыдущаяСтрока.Вставить("Организация");
	ПредыдущаяСтрока.Вставить("ПробегОборот");
	ПредыдущаяСтрока.Вставить("ПробегОбщий", 0);
	ПредыдущаяСтрока.Вставить("Период");
	
	Пока ВыборкаВерхняя.Следующий() Цикл
		Если ТипЗнч(ВыборкаВерхняя.СерияНоменклатуры) = Тип("Null") Тогда
			НоваяСтрока = ТаблицаПробега.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПредыдущаяСтрока);
			НоваяСтрока.ПробегОбщий = ПредыдущаяСтрока.ПробегОбщий;
			НоваяСтрока.ПробегОборот = 0;
			НоваяСтрока.Период = ВыборкаВерхняя.Месяц;
			ЗаполнитьЗначенияСвойств(ПредыдущаяСтрока, НоваяСтрока);
		Иначе
			Выборка = ВыборкаВерхняя.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = ТаблицаПробега.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.ПробегОбщий = ПредыдущаяСтрока.ПробегОбщий + Выборка.ПробегОборот;
				ЗаполнитьЗначенияСвойств(ПредыдущаяСтрока, НоваяСтрока);
				НоваяСтрока.Период = ВыборкаВерхняя.Месяц;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблШин.ДатаУстановкиШиныНаТС КАК ДатаУстановкиШиныНаТС,
	|	ТаблШин.ДатаСнятияШиныСТС КАК ДатаСнятияШиныСТС,
	|	ТаблШин.Шины КАК Шины,
	|	ТаблШин.ТС КАК ТС,
	|	ТаблШин.МодельТС КАК МодельТС,
	|	ТаблШин.ИнвНомерТС КАК ИнвНомерТС,
	|	ТаблШин.ГосударственныйНомер КАК ГосударственныйНомер,
	|	ТаблШин.МестоУстановки КАК МестоУстановки,
	|	ТаблШин.РегистраторПричинаОбращения КАК РегистраторПричинаОбращения
	|ПОМЕСТИТЬ ВРТ_Шины
	|ИЗ
	|	&ТаблШин КАК ТаблШин
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблПробег.ТС КАК ТС,
	|	ТаблПробег.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ТаблПробег.Организация КАК Организация,
	|	ТаблПробег.ПробегОборот КАК ПробегОборот,
	|	ТаблПробег.ПробегОбщий КАК ПробегОбщий,
	|	ТаблПробег.Период КАК Период
	|ПОМЕСТИТЬ ВРТ_Пробег
	|ИЗ
	|	&ТаблПробег КАК ТаблПробег
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	УстановленныеШины.РегистраторПричинаОбращения КАК РегистраторПричинаОбращения,
	|	УстановленныеШины.ТС КАК ТС,
	|	УстановленныеШины.МодельТС КАК МодельТС,
	|	УстановленныеШины.ДатаУстановкиШиныНаТС КАК ДатаУстановкиШиныНаТС,
	|	УстановленныеШины.ДатаСнятияШиныСТС КАК ДатаСнятияШиныСТС,
	|	УстановленныеШины.ИнвНомерТС КАК ИнвНомерТС,
	|	УстановленныеШины.ГосударственныйНомер КАК ГосударственныйНомер,
	|	Пробег.ПробегОборот КАК ПробегЗаМесяц,
	|	Пробег.ПробегОбщий КАК ПробегОбщий,
	|	Пробег.Период КАК Период
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВРТ.ДатаУстановкиШиныНаТС КАК ДатаУстановкиШиныНаТС,
	|		ВРТ.Шины КАК Шины,
	|		ВРТ.ДатаСнятияШиныСТС КАК ДатаСнятияШиныСТС,
	|		ВРТ.ТС КАК ТС,
	|		ВРТ.МодельТС КАК МодельТС,
	|		ВРТ.ИнвНомерТС КАК ИнвНомерТС,
	|		ВРТ.ГосударственныйНомер КАК ГосударственныйНомер,
	|		ВРТ.РегистраторПричинаОбращения КАК РегистраторПричинаОбращения
	|	ИЗ
	|		ВРТ_Шины КАК ВРТ) КАК УстановленныеШины
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВРТ_Пробег.ТС КАК ТС,
	|			ВРТ_Пробег.СерияНоменклатуры КАК СерияНоменклатуры,
	|			ВРТ_Пробег.Организация КАК Организация,
	|			ВРТ_Пробег.ПробегОборот КАК ПробегОборот,
	|			ВРТ_Пробег.ПробегОбщий КАК ПробегОбщий,
	|			ВРТ_Пробег.Период КАК Период
	|		ИЗ
	|			ВРТ_Пробег КАК ВРТ_Пробег) КАК Пробег
	|		ПО УстановленныеШины.Шины = Пробег.СерияНоменклатуры
	|			И УстановленныеШины.ТС = Пробег.ТС
	|ГДЕ
	|	Пробег.Период МЕЖДУ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(УстановленныеШины.ДатаУстановкиШиныНаТС, МЕСЯЦ), СЕКУНДА, -1) И ВЫБОР
	|			КОГДА УстановленныеШины.ДатаСнятияШиныСТС = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ДАТАВРЕМЯ(2100, 1, 1)
	|			ИНАЧЕ ДОБАВИТЬКДАТЕ(УстановленныеШины.ДатаСнятияШиныСТС, СЕКУНДА, 1)
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	
	Шапка = Макет.ПолучитьОбласть("Заголовок");

	Шапка.Параметры.НазваниеОрганизации	= уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(Организация, ДатаКон),
		"ПолноеНаименование, ЮридическийАдрес, Телефоны");
	
	Шапка.Параметры.Шина				= Шина;
	Шапка.Параметры.МодельШины			= ?(ФлагОбщаяМодель, МодельШины, "");
	Если ЗначениеЗаполнено(СерийныйНомер) Тогда
		Шапка.Параметры.СерийныйномерШины	= СерийныйНомер;
	Иначе
		Шапка.Параметры.СерийныйномерШины	= Шина.СерийныйНомер;
	КонецЕсли;
	Если Шина.ДатаПроизводстваШины <> Дата("00010101") Тогда
		ГодПроизводства    = Формат(Шина.ДатаПроизводстваШины, "ДФ=yy");
		НеделяПроизводства = Строка(НеделяГода(Шина.ДатаПроизводстваШины));
		ДатаИзготовления = НеделяПроизводства+ "/" + ГодПроизводства;
		Шапка.Параметры.ДатаИзготовления	= ДатаИзготовления;
	КонецЕсли;
	Шапка.Параметры.ОбозначениеШины		= ?(ФлагОбщееНаименование, ОбозначениеШины, "");
	ЗапроспоШине= новый запрос;
	ЗапросПоШине.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатМестонахождениеТССрезПоследних.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.уатАгрегатыТС.СрезПоследних(&Дата, ) КАК уатАгрегатыТССрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатМестонахождениеТС.СрезПоследних(&Дата, ) КАК уатМестонахождениеТССрезПоследних
	|		ПО уатАгрегатыТССрезПоследних.ТС = уатМестонахождениеТССрезПоследних.ТС
	|ГДЕ
	|	уатАгрегатыТССрезПоследних.СерияНоменклатуры В(&СерияНоменклатуры)
	|
	|УПОРЯДОЧИТЬ ПО
	|	уатМестонахождениеТССрезПоследних.Период УБЫВ";
	ЗапроспоШине.УстановитьПараметр("СерияНоменклатуры", ?(ФлагОбщаяМодель, мШина, Шина));
	ЗапроспоШине.УстановитьПараметр("Дата"             , ДатаКон);
	ВыборкаПоШине=ЗапроспоШине.Выполнить().Выбрать();
	Если ВыборкаПоШине.Следующий() Тогда
		Шапка.Параметры.НомерКолонны = ВыборкаПоШине.Подразделение;
	КонецЕсли;	
	
	// запрос по началу эксплуатации
	Если ЗначениеЗаполнено(Шина) ИЛИ ФлагОбщаяМодель Тогда
		ЗапросДатаПоступления = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатОстаткиАгрегатовОбороты.Период КАК Период
		|ИЗ
		|	РегистрНакопления.уатОстаткиАгрегатов.Обороты(, , Регистратор, СерияНоменклатуры В (&Шина)) КАК уатОстаткиАгрегатовОбороты
		|ГДЕ
		|	уатОстаткиАгрегатовОбороты.КоличествоПриход > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уатАгрегатыТССрезПервых.Период
		|ИЗ
		|	РегистрСведений.уатАгрегатыТС.СрезПервых(, СерияНоменклатуры В (&Шина)) КАК уатАгрегатыТССрезПервых
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период");
		ЗапросДатаПоступления.Параметры.Вставить("Шина", мШина);
		ВыборкаДатаПоступления = ЗапросДатаПоступления.Выполнить().Выбрать();
		Если ВыборкаДатаПоступления.Следующий() Тогда
			Шапка.Параметры.ДатаПоступления	= ВыборкаДатаПоступления.Период;
		КонецЕсли;
		Шапка.Параметры.Изготовитель = МодельШины.Производитель;
		Шапка.Параметры.НормаПробега = МодельШины.НормаПробега;
		Шапка.Параметры.ИндексНесущейСпособности = МодельШины.ШинаИндексНагрузки;
	КонецЕсли;
	
	ДокументРезультат.Вывести(Шапка);
	
	Если ДатаКон <> '00010101000000' Тогда
		Запрос.Параметры.Вставить("ДатаКон", КонецМесяца(ДатаКон));
	Иначе
		Запрос.Параметры.Вставить("ДатаКон", КонецМесяца(ТекущаяДата()));
	КонецЕсли;
	ТабУстановки.Сортировать("ДатаУстановкиШиныНаТС");
	Запрос.УстановитьПараметр("ТаблШин", ТабУстановки);
	Запрос.УстановитьПараметр("ТаблПробег", ТаблицаПробега);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗаголовокОтчета = Макет.ПолучитьОбласть("ЗаголовокОтчета");
	
	ДокументРезультат.Вывести(ЗаголовокОтчета);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Строка = Макет.ПолучитьОбласть("Строка");
	
	ПредыдущееТС = Справочники.уатТС.ПустаяСсылка();
	ПредыдущаяДатаСнятия = Дата("00010101");
	ПредыдущийПериод = Дата("00010101");
	ПредыдущееСостояние = Перечисления.уатСостоянияАгрегатов.ПустаяСсылка();
	
	ПредыдущаяСтрока = Новый Структура;
	ПредыдущаяСтрока.Вставить("ТС", Справочники.уатТС.ПустаяСсылка());
	ПредыдущаяСтрока.Вставить("МодельТС", Справочники.уатМоделиТС.ПустаяСсылка());
	ПредыдущаяСтрока.Вставить("ИнвНомерТС", "");
	ПредыдущаяСтрока.Вставить("ДатаУстановкиШиныНаТС", Дата("00010101"));
	ПредыдущаяСтрока.Вставить("ДатаСнятияШиныСТС", Дата("00010101"));
	ПредыдущаяСтрока.Вставить("ГосударственныйНомер", "");
	ПредыдущаяСтрока.Вставить("ПробегЗаМесяц", 0);
	ПредыдущаяСтрока.Вставить("ПробегОбщий", 0);
	ПредыдущаяСтрока.Вставить("Период", Дата("00010101"));
	
	ВыгрузкаИтоговойТаблицы = РезультатЗапроса.Выгрузить();
	
	Пока Выборка.Следующий() Цикл
		
		НайдСтроки = ВыгрузкаИтоговойТаблицы.НайтиСтроки(Новый Структура("ТС, Период", Выборка.ТС, Выборка.Период));
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	уатАгрегатыТССрезПоследних.СостояниеАгрегата КАК СостояниеАгрегата,
		|	уатАгрегатыТССрезПоследних.МестоУстановки КАК МестоУстановки
		|ИЗ
		|	РегистрСведений.уатАгрегатыТС.СрезПоследних(ДОБАВИТЬКДАТЕ(&Период, СЕКУНДА, 1), СерияНоменклатуры = &СерияНоменклатуры) КАК уатАгрегатыТССрезПоследних
		|ГДЕ
		|	уатАгрегатыТССрезПоследних.ТС = &ТС";
		
		Если НайдСтроки.Количество() > 1 Тогда
			ОбработатьМножественныеНайденныеСтроки(НайдСтроки, Выборка, ПредыдущаяСтрока, Шина, Запрос, Строка, ДокументРезультат);
		Иначе
			ОбработатьОдиночнуюСтроку(Выборка, ПредыдущаяСтрока, Шина, Запрос, Строка, ДокументРезультат, ПредыдущееСостояние);
		КонецЕсли;
		
	КонецЦикла;
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ДокументРезультат.Вывести(Подвал);
	
	// Ориентация страницы
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ПолеСлева = 0;
	ДокументРезультат.ПолеСправа = 0;
	
	// Присвоим имя для сохранения параметров печати табличного документа
	ДокументРезультат.ИмяПараметровПечати = "Карточка работы шины";
	
	Возврат ДокументРезультат;
КонецФункции // СформироватьОтчет()

// Обработка случая, когда найдено несколько строк
&НаСервере
Процедура ОбработатьМножественныеНайденныеСтроки(НайдСтроки, Выборка, ПредыдущаяСтрока, Шина, Запрос, Строка, ДокументРезультат)
	
	Сч = 1;
	Для каждого ТекНайденнаяСтрока Из НайдСтроки Цикл
		
		// Обработка перехода между ТС
		Если ТекНайденнаяСтрока.ТС <> ПредыдущаяСтрока.ТС 
			И ДобавитьМесяц(ПредыдущаяСтрока.Период, 1) = НачалоМесяца(ПредыдущаяСтрока.ДатаСнятияШиныСТС) Тогда
			
			ОбработатьПереходМеждуТС(Строка, ПредыдущаяСтрока, Шина, Запрос, ДокументРезультат);
			Запрос.УстановитьПараметр("ТС", ТекНайденнаяСтрока.ТС);
		КонецЕсли;
		
		// Обработка дат установки/снятия в одном месяце
		Если НачалоМесяца(ТекНайденнаяСтрока.ДатаУстановкиШиныНаТС) = НачалоМесяца(ТекНайденнаяСтрока.ДатаСнятияШиныСТС) 
			И Не ТекНайденнаяСтрока.ДатаУстановкиШиныНаТС = Дата("00010101") Тогда
			
			ОбработатьУстановкуИСнятиеВМесяце(ТекНайденнаяСтрока, Шина, Запрос, Строка, ДокументРезультат, Сч, НайдСтроки, Выборка);
			ЗаполнитьЗначенияСвойств(ПредыдущаяСтрока, ТекНайденнаяСтрока);
			
		ИначеЕсли НачалоМесяца(ТекНайденнаяСтрока.ДатаУстановкиШиныНаТС) = НачалоМесяца(ТекНайденнаяСтрока.Период) 
			И Не ТекНайденнаяСтрока.ДатаУстановкиШиныНаТС = Дата("00010101") Тогда
			
			ОбработатьУстановкуВМесяце(ТекНайденнаяСтрока, Шина, Запрос, Строка, ДокументРезультат, Сч, НайдСтроки, Выборка);
			ЗаполнитьЗначенияСвойств(ПредыдущаяСтрока, ТекНайденнаяСтрока);
			
		ИначеЕсли НачалоМесяца(ТекНайденнаяСтрока.ДатаСнятияШиныСТС) = НачалоМесяца(ТекНайденнаяСтрока.Период) 
			И Не ТекНайденнаяСтрока.ДатаСнятияШиныСТС = Дата("00010101") Тогда
			
			ОбработатьСнятиеВМесяце(ТекНайденнаяСтрока, Шина, Запрос, Строка, ДокументРезультат, Сч, НайдСтроки, Выборка);
			ЗаполнитьЗначенияСвойств(ПредыдущаяСтрока, ТекНайденнаяСтрока);
		КонецЕсли;
		
		Сч = Сч + 1;
	КонецЦикла;
	
КонецПроцедуры

// Обработка одиночной строки
&НаСервере
Процедура ОбработатьОдиночнуюСтроку(Выборка, ПредыдущаяСтрока, Шина, Запрос, Строка, ДокументРезультат, ПредыдущееСостояние)
	
	// Обработка перехода между ТС
	Если Выборка.ТС <> ПредыдущаяСтрока.ТС 
		И ДобавитьМесяц(ПредыдущаяСтрока.Период, 1) = НачалоМесяца(ПредыдущаяСтрока.ДатаСнятияШиныСТС) Тогда
		
		ОбработатьПереходМеждуТС(Строка, ПредыдущаяСтрока, Шина, Запрос, ДокументРезультат);
		Запрос.УстановитьПараметр("ТС", Выборка.ТС);
	КонецЕсли;
	
	// Определение даты для среза регистра
	ДатаДляСреза = ОпределитьДатуДляСреза(Выборка);
	
	// Получение состояния агрегата
	СостояниеАгрегата = ПолучитьСостояниеАгрегата(Запрос, ДатаДляСреза, Шина, Выборка.ТС);
	ЗаполнитьСостояниеВСтроке(Строка, СостояниеАгрегата);
	
	// Проверка на пропуск записи
	Если ПредыдущееСостояние = Перечисления.уатСостоянияАгрегатов.Снято 
		И Не Строка.Параметры.СостояниеАгрегата = Перечисления.уатСостоянияАгрегатов.УстановленоВРаботе Тогда
		Возврат;
	КонецЕсли;
	
	// Определение необходимости полного заполнения строки
	ЗаполнитьВсюСтроку = (ПредыдущаяСтрока.ТС <> Выборка.ТС) 
		Или (ПредыдущееСостояние <> Строка.Параметры.СостояниеАгрегата);
	
	ПредыдущееСостояние = Строка.Параметры.СостояниеАгрегата;
	
	// Заполнение и вывод строки
	Если ЗаполнитьВсюСтроку Тогда
		ЗаполнитьПолнуюСтроку(Строка, Выборка, ДокументРезультат);
	Иначе
		ЗаполнитьЧастичнуюСтроку(Строка, Выборка);
	КонецЕсли;
	
	// Установка дат установки/снятия
	УстановитьДатыВСтроке(Строка, Выборка);
	
	ДокументРезультат.Вывести(Строка);
	ЗаполнитьЗначенияСвойств(ПредыдущаяСтрока, Выборка);
	
КонецПроцедуры

// Обработка перехода между транспортными средствами
&НаСервере
Процедура ОбработатьПереходМеждуТС(Строка, ПредыдущаяСтрока, Шина, Запрос, ДокументРезультат)
	
	Запрос.УстановитьПараметр("Период", ПредыдущаяСтрока.ДатаСнятияШиныСТС);
	Запрос.УстановитьПараметр("СерияНоменклатуры", Шина);
	Запрос.УстановитьПараметр("ТС", ПредыдущаяСтрока.ТС);
	
	СостояниеАгрегата = ПолучитьСостояниеАгрегата(Запрос, ПредыдущаяСтрока.ДатаСнятияШиныСТС, Шина, ПредыдущаяСтрока.ТС);
	ЗаполнитьСостояниеВСтроке(Строка, СостояниеАгрегата);
	
	НачальноеЗначениеОдометра = ПолучитьНачальноеЗначениеОдометра(ПредыдущаяСтрока.МодельТС, ПредыдущаяСтрока.ТС, ПредыдущаяСтрока.Период);
	
	Строка.Параметры.Заполнить(ПредыдущаяСтрока);
	Строка.Параметры.ПредставлениеТС = ПредыдущаяСтрока.ГосударственныйНомер + ", " + ПредыдущаяСтрока.МодельТС + ", " + ПредыдущаяСтрока.ИнвНомерТС;
	Строка.Параметры.ТС = ПредыдущаяСтрока.ТС;
	Строка.Параметры.ПредставлениеПериода = Строка(Формат(ПредыдущаяСтрока.Период, "ДФ=MM.yyyy")) + "г.";
	Строка.Параметры.ЗаМесяц = ПредыдущаяСтрока.ПробегЗаМесяц/1000;
	Строка.Параметры.ПробегОбщий = ПредыдущаяСтрока.ПробегОбщий/1000;
	Строка.Параметры.ПоказанияОдометра = НачальноеЗначениеОдометра;
	Строка.Параметры.ДатаУстановкиШиныНаТС = 0;
	Строка.Параметры.ДатаСнятияШиныСТС = ПредыдущаяСтрока.ДатаСнятияШиныСТС;
	
	ДокументРезультат.Вывести(Строка);
	
КонецПроцедуры

// Получение состояния агрегата из регистра
&НаСервере
Функция ПолучитьСостояниеАгрегата(Запрос, Период, СерияНоменклатуры, ТС)
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СерияНоменклатуры", СерияНоменклатуры);
	Запрос.УстановитьПараметр("ТС", ТС);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Заполнение полей состояния в строке результата
&НаСервере
Процедура ЗаполнитьСостояниеВСтроке(Строка, ДанныеСостояния)
	
	Если ДанныеСостояния <> Неопределено Тогда
		Строка.Параметры.СостояниеАгрегата = ДанныеСостояния.СостояниеАгрегата;
		Строка.Параметры.МестоУстановки = ДанныеСостояния.МестоУстановки;
	Иначе
		Строка.Параметры.СостояниеАгрегата = Перечисления.уатСостоянияАгрегатов.ПустаяСсылка();
		Строка.Параметры.МестоУстановки = Справочники.уатМестаУстановкиШин.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

// Получение начального значения одометра в зависимости от модели ТС
&НаСервере
Функция ПолучитьНачальноеЗначениеОдометра(МодельТС, ТС, Период)
	
	Если МодельТС.НаличиеСпидометра = Истина Тогда
		Возврат уатОбщегоНазначения.уатТекущийСпидометр(ТС, Период);
	Иначе
		Возврат уатОбщегоНазначения.уатТекущийСчетчикМЧ(ТС, Период);
	КонецЕсли;
	
КонецФункции

// Определение даты для среза регистра сведений
&НаСервере
Функция ОпределитьДатуДляСреза(Выборка)
	
	Если НачалоМесяца(Выборка.ДатаУстановкиШиныНаТС) = НачалоМесяца(Выборка.Период) Тогда
		Возврат Выборка.ДатаУстановкиШиныНаТС;
	ИначеЕсли НачалоМесяца(Выборка.ДатаСнятияШиныСТС) = НачалоМесяца(Выборка.Период) Тогда
		Возврат Выборка.ДатаСнятияШиныСТС;
	Иначе
		Возврат Выборка.Период;
	КонецЕсли;
	
КонецФункции

// Заполнение полной строки результата
&НаСервере
Процедура ЗаполнитьПолнуюСтроку(Строка, ИсточникДанных, ДокументРезультат)
	
	НачальноеЗначениеОдометра = ПолучитьНачальноеЗначениеОдометра(ИсточникДанных.МодельТС, ИсточникДанных.ТС, ИсточникДанных.Период);
	
	Строка.Параметры.Заполнить(ИсточникДанных);
	Строка.Параметры.ПредставлениеТС = ИсточникДанных.ГосударственныйНомер + ", " + ИсточникДанных.МодельТС + ", " + ИсточникДанных.ИнвНомерТС;
	Строка.Параметры.ТС = ИсточникДанных.ТС;
	Строка.Параметры.ПредставлениеПериода = Строка(Формат(ИсточникДанных.Период, "ДФ=MM.yyyy")) + "г.";
	Строка.Параметры.ЗаМесяц = ИсточникДанных.ПробегЗаМесяц/1000;
	Строка.Параметры.ПробегОбщий = ИсточникДанных.ПробегОбщий/1000;
	Строка.Параметры.ПоказанияОдометра = НачальноеЗначениеОдометра;
	
КонецПроцедуры

// Заполнение частичной строки (только изменяемые поля)
&НаСервере
Процедура ЗаполнитьЧастичнуюСтроку(Строка, ИсточникДанных)
	ПустаяСтрока = Новый Структура;
	ПустаяСтрока.Вставить("ПредставлениеТС", "");
	ПустаяСтрока.Вставить("ПоказанияОдометра", 0);
	ПустаяСтрока.Вставить("ДатаУстановкиШиныНаТС", 0);
	ПустаяСтрока.Вставить("ДатаСнятияШиныСТС", 0);
	ПустаяСтрока.Вставить("РегистраторПричинаОбращения", 0);
	
	Строка.Параметры.Заполнить(ПустаяСтрока);
	Строка.Параметры.ЗаМесяц = ИсточникДанных.ПробегЗаМесяц/1000;
	Строка.Параметры.ПробегОбщий = ИсточникДанных.ПробегОбщий/1000;
	Строка.Параметры.ПредставлениеПериода = Строка(Формат(ИсточникДанных.Период, "ДФ=MM.yyyy")) + "г.";
	
КонецПроцедуры

// Установка дат установки/снятия в зависимости от состояния
&НаСервере
Процедура УстановитьДатыВСтроке(Строка, ИсточникДанных)
	
	Если Строка.Параметры.СостояниеАгрегата = Перечисления.уатСостоянияАгрегатов.УстановленоВРаботе Тогда
		Строка.Параметры.ДатаУстановкиШиныНаТС = ИсточникДанных.ДатаУстановкиШиныНаТС;
		Строка.Параметры.ДатаСнятияШиныСТС = 0;
	ИначеЕсли Строка.Параметры.СостояниеАгрегата = Перечисления.уатСостоянияАгрегатов.Снято Тогда
		Строка.Параметры.ДатаУстановкиШиныНаТС = 0;
		Строка.Параметры.ДатаСнятияШиныСТС = ИсточникДанных.ДатаСнятияШиныСТС;
	КонецЕсли;
	
КонецПроцедуры

// Обработка случая: установка и снятие в одном месяце
&НаСервере
Процедура ОбработатьУстановкуИСнятиеВМесяце(ТекНайденнаяСтрока, Шина, Запрос, Строка, ДокументРезультат, Сч, НайдСтроки, Выборка)
	
	// Первая запись - установка
	Запрос.УстановитьПараметр("Период", ТекНайденнаяСтрока.ДатаУстановкиШиныНаТС);
	Запрос.УстановитьПараметр("СерияНоменклатуры", Шина);
	СостояниеАгрегата = ПолучитьСостояниеАгрегата(Запрос, ТекНайденнаяСтрока.ДатаУстановкиШиныНаТС, Шина, ТекНайденнаяСтрока.ТС);
	ЗаполнитьСостояниеВСтроке(Строка, СостояниеАгрегата);
	
	НачальноеЗначениеОдометра = ПолучитьНачальноеЗначениеОдометра(ТекНайденнаяСтрока.МодельТС, ТекНайденнаяСтрока.ТС, ТекНайденнаяСтрока.Период);
	
	Строка.Параметры.Заполнить(ТекНайденнаяСтрока);
	Строка.Параметры.ПредставлениеТС = ТекНайденнаяСтрока.ГосударственныйНомер + ", " + ТекНайденнаяСтрока.МодельТС + ", " + ТекНайденнаяСтрока.ИнвНомерТС;
	Строка.Параметры.ТС = ТекНайденнаяСтрока.ТС;
	Строка.Параметры.ПредставлениеПериода = Строка(Формат(ТекНайденнаяСтрока.Период, "ДФ=MM.yyyy")) + "г.";
	Строка.Параметры.ЗаМесяц = "⬇";
	Строка.Параметры.ПробегОбщий = ТекНайденнаяСтрока.ПробегОбщий/1000;
	Строка.Параметры.ПоказанияОдометра = НачальноеЗначениеОдометра;
	Строка.Параметры.ДатаУстановкиШиныНаТС = ТекНайденнаяСтрока.ДатаУстановкиШиныНаТС;
	Строка.Параметры.ДатаСнятияШиныСТС = 0;
	ДокументРезультат.Вывести(Строка);
	
	// Вторая запись - снятие
	Запрос.УстановитьПараметр("Период", ТекНайденнаяСтрока.ДатаСнятияШиныСТС - 1);
	Запрос.УстановитьПараметр("СерияНоменклатуры", Шина);
	СостояниеАгрегата = ПолучитьСостояниеАгрегата(Запрос, ТекНайденнаяСтрока.ДатаСнятияШиныСТС - 1, Шина, ТекНайденнаяСтрока.ТС);
	ЗаполнитьСостояниеВСтроке(Строка, СостояниеАгрегата);
	
	НачальноеЗначениеОдометра = ПолучитьНачальноеЗначениеОдометра(ТекНайденнаяСтрока.МодельТС, ТекНайденнаяСтрока.ТС, ТекНайденнаяСтрока.Период);
	
	Строка.Параметры.Заполнить(ТекНайденнаяСтрока);
	Строка.Параметры.ПредставлениеТС = ТекНайденнаяСтрока.ГосударственныйНомер + ", " + ТекНайденнаяСтрока.МодельТС + ", " + ТекНайденнаяСтрока.ИнвНомерТС;
	Строка.Параметры.ТС = ТекНайденнаяСтрока.ТС;
	Строка.Параметры.ПредставлениеПериода = Строка(Формат(ТекНайденнаяСтрока.Период, "ДФ=MM.yyyy")) + "г.";
	
	Если Сч = НайдСтроки.Количество() Тогда
		Строка.Параметры.ЗаМесяц = ТекНайденнаяСтрока.ПробегЗаМесяц/1000;
	Иначе
		Выборка.Следующий();
		Строка.Параметры.ЗаМесяц = "⬇";
	КонецЕсли;
	
	Строка.Параметры.ПробегОбщий = ТекНайденнаяСтрока.ПробегОбщий/1000;
	Строка.Параметры.ПоказанияОдометра = НачальноеЗначениеОдометра;
	Строка.Параметры.ДатаУстановкиШиныНаТС = 0;
	Строка.Параметры.ДатаСнятияШиныСТС = ТекНайденнаяСтрока.ДатаСнятияШиныСТС;
	ДокументРезультат.Вывести(Строка);
	
КонецПроцедуры

// Обработка случая: установка в месяце отчётности
&НаСервере
Процедура ОбработатьУстановкуВМесяце(ТекНайденнаяСтрока, Шина, Запрос, Строка, ДокументРезультат, Сч, НайдСтроки, Выборка)
	
	Запрос.УстановитьПараметр("Период", ТекНайденнаяСтрока.ДатаУстановкиШиныНаТС);
	Запрос.УстановитьПараметр("СерияНоменклатуры", Шина);
	СостояниеАгрегата = ПолучитьСостояниеАгрегата(Запрос, ТекНайденнаяСтрока.ДатаУстановкиШиныНаТС, Шина, ТекНайденнаяСтрока.ТС);
	ЗаполнитьСостояниеВСтроке(Строка, СостояниеАгрегата);
	
	НачальноеЗначениеОдометра = ПолучитьНачальноеЗначениеОдометра(ТекНайденнаяСтрока.МодельТС, ТекНайденнаяСтрока.ТС, ТекНайденнаяСтрока.Период);
	
	Строка.Параметры.Заполнить(ТекНайденнаяСтрока);
	Строка.Параметры.ПредставлениеТС = ТекНайденнаяСтрока.ГосударственныйНомер + ", " + ТекНайденнаяСтрока.МодельТС + ", " + ТекНайденнаяСтрока.ИнвНомерТС;
	Строка.Параметры.ТС = ТекНайденнаяСтрока.ТС;
	Строка.Параметры.ПредставлениеПериода = Строка(Формат(ТекНайденнаяСтрока.Период, "ДФ=MM.yyyy")) + "г.";
	
	Если Сч = НайдСтроки.Количество() Тогда
		Строка.Параметры.ЗаМесяц = ТекНайденнаяСтрока.ПробегЗаМесяц/1000;
	Иначе
		Выборка.Следующий();
		Строка.Параметры.ЗаМесяц = "⬇";
	КонецЕсли;
	
	Строка.Параметры.ПробегОбщий = ТекНайденнаяСтрока.ПробегОбщий/1000;
	Строка.Параметры.ПоказанияОдометра = НачальноеЗначениеОдометра;
	Строка.Параметры.ДатаУстановкиШиныНаТС = ТекНайденнаяСтрока.ДатаУстановкиШиныНаТС;
	Строка.Параметры.ДатаСнятияШиныСТС = 0;
	ДокументРезультат.Вывести(Строка);
	
КонецПроцедуры

// Обработка случая: снятие в месяце отчётности
&НаСервере
Процедура ОбработатьСнятиеВМесяце(ТекНайденнаяСтрока, Шина, Запрос, Строка, ДокументРезультат, Сч, НайдСтроки, Выборка)
	
	Запрос.УстановитьПараметр("Период", ТекНайденнаяСтрока.ДатаСнятияШиныСТС - 1);
	Запрос.УстановитьПараметр("СерияНоменклатуры", Шина);
	СостояниеАгрегата = ПолучитьСостояниеАгрегата(Запрос, ТекНайденнаяСтрока.ДатаСнятияШиныСТС - 1, Шина, ТекНайденнаяСтрока.ТС);
	ЗаполнитьСостояниеВСтроке(Строка, СостояниеАгрегата);
	
	НачальноеЗначениеОдометра = ПолучитьНачальноеЗначениеОдометра(ТекНайденнаяСтрока.МодельТС, ТекНайденнаяСтрока.ТС, ТекНайденнаяСтрока.Период);
	
	Строка.Параметры.Заполнить(ТекНайденнаяСтрока);
	Строка.Параметры.ПредставлениеТС = ТекНайденнаяСтрока.ГосударственныйНомер + ", " + ТекНайденнаяСтрока.МодельТС + ", " + ТекНайденнаяСтрока.ИнвНомерТС;
	Строка.Параметры.ТС = ТекНайденнаяСтрока.ТС;
	Строка.Параметры.ПредставлениеПериода = Строка(Формат(ТекНайденнаяСтрока.Период, "ДФ=MM.yyyy")) + "г.";
	
	Если Сч = НайдСтроки.Количество() Тогда
		Строка.Параметры.ЗаМесяц = ТекНайденнаяСтрока.ПробегЗаМесяц/1000;
	Иначе
		Выборка.Следующий();
		Строка.Параметры.ЗаМесяц = "⬇";
	КонецЕсли;
	
	Строка.Параметры.ПробегОбщий = ТекНайденнаяСтрока.ПробегОбщий/1000;
	Строка.Параметры.ПоказанияОдометра = НачальноеЗначениеОдометра;
	Строка.Параметры.ДатаУстановкиШиныНаТС = 0;
	Строка.Параметры.ДатаСнятияШиныСТС = ТекНайденнаяСтрока.ДатаСнятияШиныСТС;
	ДокументРезультат.Вывести(Строка);
	
КонецПроцедуры

#КонецОбласти
